Revit 2024 API
LevelAssociationData.GetLevelOffset Method
 Returns the offset from the Associated Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double GetLevelOffset()
Visual Basic
Public Function GetLevelOffset As Double
Visual C++
public:
double GetLevelOffset()
See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace